In [1]:
%pwd

'/home/acr/Documents/Course: Python for Data Science and Machine Learning Bootcamp/Jupyter/Pandas'

In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
np.random.seed(101)

In [15]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.279510  1.062710  1.752014  0.695547
B  0.153661  0.167638 -0.765930  0.962299
C  0.902826 -0.537909 -1.549671  0.435253
D  1.259904 -0.447898  0.266207  0.412580
E  0.988773  0.513833 -0.928205  0.846904

In [18]:
df['W']

A   -0.279510
B    0.153661
C    0.902826
D    1.259904
E    0.988773
Name: W, dtype: float64

In [19]:
type(df['W'])

pandas.core.series.Series

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
df[['W','Z']]

          W         Z
A -0.279510  0.695547
B  0.153661  0.962299
C  0.902826  0.435253
D  1.259904  0.412580
E  0.988773  0.846904

In [24]:
# Creating a column
df['new'] = df['W']+df['Y']+df['Z']
df

          W         X         Y         Z       new
A -0.279510  1.062710  1.752014  0.695547  2.168051
B  0.153661  0.167638 -0.765930  0.962299  0.350030
C  0.902826 -0.537909 -1.549671  0.435253 -0.211592
D  1.259904 -0.447898  0.266207  0.412580  1.938691
E  0.988773  0.513833 -0.928205  0.846904  0.907472

In [26]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.279510  1.062710  1.752014  0.695547
B  0.153661  0.167638 -0.765930  0.962299
C  0.902826 -0.537909 -1.549671  0.435253
D  1.259904 -0.447898  0.266207  0.412580
E  0.988773  0.513833 -0.928205  0.846904

In [27]:
df

          W         X         Y         Z       new
A -0.279510  1.062710  1.752014  0.695547  2.168051
B  0.153661  0.167638 -0.765930  0.962299  0.350030
C  0.902826 -0.537909 -1.549671  0.435253 -0.211592
D  1.259904 -0.447898  0.266207  0.412580  1.938691
E  0.988773  0.513833 -0.928205  0.846904  0.907472

In [28]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A -0.279510  1.062710  1.752014  0.695547
B  0.153661  0.167638 -0.765930  0.962299
C  0.902826 -0.537909 -1.549671  0.435253
D  1.259904 -0.447898  0.266207  0.412580
E  0.988773  0.513833 -0.928205  0.846904

In [29]:
df.drop('E',axis=0)

          W         X         Y         Z
A -0.279510  1.062710  1.752014  0.695547
B  0.153661  0.167638 -0.765930  0.962299
C  0.902826 -0.537909 -1.549671  0.435253
D  1.259904 -0.447898  0.266207  0.412580

In [30]:
df

          W         X         Y         Z
A -0.279510  1.062710  1.752014  0.695547
B  0.153661  0.167638 -0.765930  0.962299
C  0.902826 -0.537909 -1.549671  0.435253
D  1.259904 -0.447898  0.266207  0.412580
E  0.988773  0.513833 -0.928205  0.846904

In [31]:
df.shape

(5, 4)

# ROWS

In [32]:
df.loc['A']

W   -0.279510
X    1.062710
Y    1.752014
Z    0.695547
Name: A, dtype: float64

In [33]:
df.iloc[2] # Index location

W    0.902826
X   -0.537909
Y   -1.549671
Z    0.435253
Name: C, dtype: float64

In [34]:
df.loc['B','Y']

-0.7659300746299967

In [35]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.279510  1.752014
B  0.153661 -0.765930

# Selection in dataframes

In [36]:
df

          W         X         Y         Z
A -0.279510  1.062710  1.752014  0.695547
B  0.153661  0.167638 -0.765930  0.962299
C  0.902826 -0.537909 -1.549671  0.435253
D  1.259904 -0.447898  0.266207  0.412580
E  0.988773  0.513833 -0.928205  0.846904

In [37]:
df > 0

       W      X      Y     Z
A  False   True   True  True
B   True   True  False  True
C   True  False  False  True
D   True  False   True  True
E   True   True  False  True

In [38]:
booldf = df>0

In [39]:
df[booldf]

          W         X         Y         Z
A       NaN  1.062710  1.752014  0.695547
B  0.153661  0.167638       NaN  0.962299
C  0.902826       NaN       NaN  0.435253
D  1.259904       NaN  0.266207  0.412580
E  0.988773  0.513833       NaN  0.846904

In [40]:
df[df>0]

          W         X         Y         Z
A       NaN  1.062710  1.752014  0.695547
B  0.153661  0.167638       NaN  0.962299
C  0.902826       NaN       NaN  0.435253
D  1.259904       NaN  0.266207  0.412580
E  0.988773  0.513833       NaN  0.846904

In [41]:
df['W']>0

A    False
B     True
C     True
D     True
E     True
Name: W, dtype: bool

In [42]:
df[df['W']>0]

          W         X         Y         Z
B  0.153661  0.167638 -0.765930  0.962299
C  0.902826 -0.537909 -1.549671  0.435253
D  1.259904 -0.447898  0.266207  0.412580
E  0.988773  0.513833 -0.928205  0.846904

In [46]:
resultdf= df[df['Y']>0]
resultdf

          W         X         Y         Z
A -0.279510  1.062710  1.752014  0.695547
D  1.259904 -0.447898  0.266207  0.412580

In [47]:
resultdf['X']

A    1.062710
D   -0.447898
Name: X, dtype: float64

In [48]:
df[df['Y']>0]['X']

A    1.062710
D   -0.447898
Name: X, dtype: float64

In [52]:
bool_series=df['W']>0
result=df[bool_series]
my_columns = ['Y','X']
result[my_columns]

          Y         X
B -0.765930  0.167638
C -1.549671 -0.537909
D  0.266207 -0.447898
E -0.928205  0.513833

In [55]:
df[(df['W']>0 and (df['Y']>1))]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [57]:
df

          W         X         Y         Z
A -0.279510  1.062710  1.752014  0.695547
B  0.153661  0.167638 -0.765930  0.962299
C  0.902826 -0.537909 -1.549671  0.435253
D  1.259904 -0.447898  0.266207  0.412580
E  0.988773  0.513833 -0.928205  0.846904

In [60]:
df[(df['W']>0) & (df['Y']<-1)] # Conditions of return in dataframes

          W         X         Y         Z
C  0.902826 -0.537909 -1.549671  0.435253

In [70]:
df[(df['W']>0) | (df['Y']<-1)] # Conditions of return in dataframes

          W         X         Y         Z States
B  0.153661  0.167638 -0.765930  0.962299     NY
C  0.902826 -0.537909 -1.549671  0.435253     WY
D  1.259904 -0.447898  0.266207  0.412580     OR
E  0.988773  0.513833 -0.928205  0.846904     CO

In [61]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.279510  1.062710  1.752014  0.695547
1     B  0.153661  0.167638 -0.765930  0.962299
2     C  0.902826 -0.537909 -1.549671  0.435253
3     D  1.259904 -0.447898  0.266207  0.412580
4     E  0.988773  0.513833 -0.928205  0.846904

In [62]:
df

          W         X         Y         Z
A -0.279510  1.062710  1.752014  0.695547
B  0.153661  0.167638 -0.765930  0.962299
C  0.902826 -0.537909 -1.549671  0.435253
D  1.259904 -0.447898  0.266207  0.412580
E  0.988773  0.513833 -0.928205  0.846904

In [64]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [65]:
df['States']=newind

In [66]:
df

          W         X         Y         Z States
A -0.279510  1.062710  1.752014  0.695547     CA
B  0.153661  0.167638 -0.765930  0.962299     NY
C  0.902826 -0.537909 -1.549671  0.435253     WY
D  1.259904 -0.447898  0.266207  0.412580     OR
E  0.988773  0.513833 -0.928205  0.846904     CO

In [69]:
df.set_index('States') # Put a column as an index

               W         X         Y         Z
States
CA     -0.279510  1.062710  1.752014  0.695547
NY      0.153661  0.167638 -0.765930  0.962299
WY      0.902826 -0.537909 -1.549671  0.435253
OR      1.259904 -0.447898  0.266207  0.412580
CO      0.988773  0.513833 -0.928205  0.846904

In [68]:
df

          W         X         Y         Z States
A -0.279510  1.062710  1.752014  0.695547     CA
B  0.153661  0.167638 -0.765930  0.962299     NY
C  0.902826 -0.537909 -1.549671  0.435253     WY
D  1.259904 -0.447898  0.266207  0.412580     OR
E  0.988773  0.513833 -0.928205  0.846904     CO

# Multi index and index higher key

In [71]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [74]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [73]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1 -0.854860  1.602816
   2  0.185479 -0.994018
   3 -0.131906 -1.335092
G2 1 -0.089298  0.698566
   2 -1.409126  0.870907
   3  1.585812  0.929658

In [75]:
df.loc['G1']

          A         B
1 -0.854860  1.602816
2  0.185479 -0.994018
3 -0.131906 -1.335092

In [78]:
df.loc['G1'].loc[1]

A   -0.854860
B    1.602816
Name: 1, dtype: float64

In [80]:
df.index.names

FrozenList([None, None])

In [82]:
df.index.names=['Groups','Num']
df

                   A         B
Groups Num
G1     1   -0.854860  1.602816
       2    0.185479 -0.994018
       3   -0.131906 -1.335092
G2     1   -0.089298  0.698566
       2   -1.409126  0.870907
       3    1.585812  0.929658

In [85]:
df.loc['G2'].loc[2]['B']

0.8709070168048411

In [86]:
df.xs

<bound method NDFrame.xs of                    A         B
Groups Num
G1     1   -0.854860  1.602816
       2    0.185479 -0.994018
       3   -0.131906 -1.335092
G2     1   -0.089298  0.698566
       2   -1.409126  0.870907
       3    1.585812  0.929658>

In [89]:
df.xs('G1')

            A         B
Num
1   -0.854860  1.602816
2    0.185479 -0.994018
3   -0.131906 -1.335092

In [90]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.854860  1.602816
G2     -0.089298  0.698566